# Join avec deux tables

```sql
CREATE DATABASE joins;

CREATE TABLE IF NOT EXISTS table1 (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    value INT
);

CREATE TABLE IF NOT EXISTS table2 (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    value INT
);

-- Insérer dans table1
INSERT INTO table1 (id, name, value) VALUES (1, 'Hubert', 100);
INSERT INTO table1 (id, name, value) VALUES (2, 'Jack', 200) ;
INSERT INTO table1 (id, name, value) VALUES (5, 'Jean', 500) ;

-- Insérer dans table2
INSERT INTO table2 (id, name, value) VALUES (2, 'Jack', 200) ;
INSERT INTO table2 (id, name, value) VALUES (3, 'Jacques', 300) ;
INSERT INTO table2 (id, name, value) VALUES (4, 'Jax', 400) ;
```

```sql
SELECT *
FROM table1
LEFT JOIN table2 ON table1.id = table2.id;
```

 id |  name  | value | id | name | value
----+--------+-------+----+------+-------
  1 | Hubert |   100 |    |      |
  2 | Jack   |   200 |  2 | Jack |   200
  5 | Jean   |   500 |    |      |
(3 rows)

```sql
SELECT *
FROM table1
INNER JOIN table2 ON table1.id = table2.id;
```

 id | name | value | id | name | value
----+------+-------+----+------+-------
  2 | Jack |   200 |  2 | Jack |   200
(1 row)

```sql
SELECT *
FROM table1
FULL OUTER JOIN table2 ON table1.id = table2.id;
```

 id |  name  | value | id |  name   | value
----+--------+-------+----+---------+-------
  1 | Hubert |   100 |    |         |
  2 | Jack   |   200 |  2 | Jack    |   200
  5 | Jean   |   500 |    |         |
    |        |       |  4 | Jax     |   400
    |        |       |  3 | Jacques |   300
(5 rows)

## Self Join : toutes les paire avec répétition A/B et B/A (et A/A)
- répétition A/B et B/A et paires uniques : A/A

```sql
SELECT *
FROM table1 AS first
INNER JOIN table1 ON true;
```

 id |  name  | value | id |  name  | value
----+--------+-------+----+--------+-------
  1 | Hubert |   100 |  1 | Hubert |   100
  1 | Hubert |   100 |  2 | Jack   |   200
  1 | Hubert |   100 |  5 | Jean   |   500
  2 | Jack   |   200 |  1 | Hubert |   100
  2 | Jack   |   200 |  2 | Jack   |   200
  2 | Jack   |   200 |  5 | Jean   |   500
  5 | Jean   |   500 |  1 | Hubert |   100
  5 | Jean   |   500 |  2 | Jack   |   200
  5 | Jean   |   500 |  5 | Jean   |   500
(9 rows)

## Self Join : toutes les paires mais pas de répétition A/A
- répétition A/B et B/A et mais pas les paires uniques : A/A

```sql
SELECT *
FROM table1 AS first
INNER JOIN table1 AS second ON first.id <> second.id;
```

 id |  name  | value | id |  name  | value
----+--------+-------+----+--------+-------
  1 | Hubert |   100 |  2 | Jack   |   200
  1 | Hubert |   100 |  5 | Jean   |   500
  2 | Jack   |   200 |  1 | Hubert |   100
  2 | Jack   |   200 |  5 | Jean   |   500
  5 | Jean   |   500 |  1 | Hubert |   100
  5 | Jean   |   500 |  2 | Jack   |   200
(6 rows)

## Self Join : paire uniques et pas de répétition A/B & B/A
- pas de répétition A/B et B/A avec `ON first.id < second.id;`
- et donc pas non plus de lignes avec deux fois le même prénom

```sql
SELECT *
FROM table1 AS first
INNER JOIN table1 second ON first.id < second.id;
```

 id |  name  | value | id | name | value
----+--------+-------+----+------+-------
  1 | Hubert |   100 |  2 | Jack |   200
  1 | Hubert |   100 |  5 | Jean |   500
  2 | Jack   |   200 |  5 | Jean |   500
(3 rows)